# 1. Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.

usern = int(input('Введите трехзначное число: '))
if usern > 999 or usern < 100:
    print('Вы ввели не трехзначное число!')
else:
    e = (usern % 10)
    d = ((usern % 100) - e) // 10
    h = (usern - (d + e)) // 100
    print('Произведение цифр числа: ', h * d * e)
    print('Сумма цифр числа: ', h + d + e)

# 2. Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6. Выполнить над числом 5 побитовый сдвиг
# вправо и влево на два знака. Объяснить полученный результат.

bit_and = 5 & 6
bit_or = 5 | 6
bit_xor = 5 ^ 6
print(f'Логические побитовые операции над числами 5 и 6:\n' f'Логическая операция "И" ~ {bit_and}\n'
      f'Логическая операция "ИЛИ" ~ {bit_or}\n' f'Логическая операция "ИСКЛЮЧАЮЩЕЕ ИЛИ" ~ {bit_xor}')
print( f'Побитовый сдвиг вправо на два знака числа 5: {5 << 2}\n' 
       f'Побитовый сдвиг влево на два знака числа 5: {5 >> 2}')

# 3. По введенным пользователем координатам двух точек вывести уравнение прямой вида y=kx+b, проходящей через эти точки.



# 4. Написать программу, которая генерирует в указанных пользователем границах:
# случайное целое число;
# случайное вещественное число;
# случайный символ.

import random

a1 = int(input('Введите число для начальной границы целого числа: '))
a2 = int(input('Введите число для конечной границы целого числа: '))
b1 = float(input('Введите начальную границу случайного вещественного числа: '))
b2 = float(input('Введите конечную границу случайного вещественного числа: '))
r_int = random.randint(a1, a2)
r_float = random.uniform(b1, b2)
print(f'Случайное целое число: {r_int}\n' f'Случайное вещественное число: {r_float}\n')

# 5. Пользователь вводит две буквы. Определить, на каких местах алфавита они стоят и сколько между ними находится букв.

char1 = input('Введите первую букву: ')
char2 = input('Введите вторую букву: ')
pos_char1 = ord(char1) - 64
pos_char2 = ord(char2) - 64
distance = abs(pos_char1 - pos_char2) - 1
print(f'Буква "{char1}" {pos_char1}-я в алфавите\n' f'Буква "{char2}" {pos_char2}-я в алфавите\n'
      f'Между буквами {distance} букв')

# 6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

usern = int(input('Введите номер буквы в алфавите от 1 до 26: '))
char = chr(usern + 64)
print(f'Это буква "{char}"')

# 7. По длинам трех отрезков, введенных пользователем, определить возможность существования треугольника, составленного
# из этих отрезков. Если такой треугольник существует, то определить, является ли он разносторонним, равнобедренным или
# равносторонним.



# 8. Определить, является ли год, который ввел пользователем, високосным или невисокосным.

year = int(input('Введите год: '))
if year < 1582:
    print(f'{year} год был до введения григорианского календаря в котором нет високосного года!')
else:
    if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:
        print(f'Год {year}, високосный')
    else:
        print(f'Год {year}, невисокосный')

# 9. Вводятся три разных числа. Найти, какое из них является средним (больше одного, но меньше другого).

a = float(input('Ведите 3 разных числа:\n' 'a = '))
b = float(input('b = '))
c = float(input('c = '))
mid = a + b + c - max(a, b, c) - min(a, b, c)
print(f'Число {mid} - среднее')
